In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.DataFrame(np.random.randn(10, 4))

In [ ]:
df

          0         1         2         3
0 -0.953957 -0.145949  2.145194  0.325197
1  1.766116  1.568794  0.665628  0.223393
2 -0.131197 -0.978466 -0.603898  0.344533
3 -0.502081 -0.016002 -1.080537  1.038217
4  0.551330 -1.430087  0.791471 -2.286282
5  0.711356 -0.664951 -1.121766 -0.122777
6  1.357047  0.591635 -0.487670  0.996917
7 -1.995902  1.229053 -0.245736  0.207742
8 -1.150965  3.133243  0.072859  1.473219
9  2.585600  0.756818 -0.848721 -0.860181

In [ ]:
df[-2:]

          0         1         2         3
8 -1.150965  3.133243  0.072859  1.473219
9  2.585600  0.756818 -0.848721 -0.860181

In [ ]:
df[:-2]

          0         1         2         3
0 -0.953957 -0.145949  2.145194  0.325197
1  1.766116  1.568794  0.665628  0.223393
2 -0.131197 -0.978466 -0.603898  0.344533
3 -0.502081 -0.016002 -1.080537  1.038217
4  0.551330 -1.430087  0.791471 -2.286282
5  0.711356 -0.664951 -1.121766 -0.122777
6  1.357047  0.591635 -0.487670  0.996917
7 -1.995902  1.229053 -0.245736  0.207742

In [ ]:
df[:]

          0         1         2         3
0 -0.953957 -0.145949  2.145194  0.325197
1  1.766116  1.568794  0.665628  0.223393
2 -0.131197 -0.978466 -0.603898  0.344533
3 -0.502081 -0.016002 -1.080537  1.038217
4  0.551330 -1.430087  0.791471 -2.286282
5  0.711356 -0.664951 -1.121766 -0.122777
6  1.357047  0.591635 -0.487670  0.996917
7 -1.995902  1.229053 -0.245736  0.207742
8 -1.150965  3.133243  0.072859  1.473219
9  2.585600  0.756818 -0.848721 -0.860181

In [ ]:
dates = pd.date_range('1/1/2000', periods=8)
df = pd.DataFrame(np.random.randn(8, 4),index=dates, columns=['A', 'B', 'C', 'D'])

In [ ]:
df

                   A         B         C         D
2000-01-01  2.267193  1.925006  0.149171 -1.893652
2000-01-02  1.516211 -1.073621 -1.299932  1.461930
2000-01-03 -0.519746 -0.012736  0.535094  0.373058
2000-01-04 -0.783098 -0.333231 -0.742752 -0.143432
2000-01-05  0.712373 -1.091687  0.401944  0.344534
2000-01-06 -0.944119 -0.423561 -0.490234  1.581485
2000-01-07  1.960937 -0.130032  0.117467 -1.018090
2000-01-08 -0.544574  1.797448 -0.259759 -0.599212

In [ ]:
type(df[['A']])

pandas.core.frame.DataFrame

In [ ]:
df[['B', 'A']]

                   B         A
2000-01-01  1.925006  2.267193
2000-01-02 -1.073621  1.516211
2000-01-03 -0.012736 -0.519746
2000-01-04 -0.333231 -0.783098
2000-01-05 -1.091687  0.712373
2000-01-06 -0.423561 -0.944119
2000-01-07 -0.130032  1.960937
2000-01-08  1.797448 -0.544574

In [ ]:
df['E'] = [1,2,3,4,5,6,7,8]
df

                   A         B         C         D  E
2000-01-01  2.267193  1.925006  0.149171 -1.893652  1
2000-01-02  1.516211 -1.073621 -1.299932  1.461930  2
2000-01-03 -0.519746 -0.012736  0.535094  0.373058  3
2000-01-04 -0.783098 -0.333231 -0.742752 -0.143432  4
2000-01-05  0.712373 -1.091687  0.401944  0.344534  5
2000-01-06 -0.944119 -0.423561 -0.490234  1.581485  6
2000-01-07  1.960937 -0.130032  0.117467 -1.018090  7
2000-01-08 -0.544574  1.797448 -0.259759 -0.599212  8

In [ ]:
type(df.loc['2000-01-01':'2000-01-04'])

pandas.core.frame.DataFrame

In [ ]:
df.loc['2000-01-01':'2000-01-04']

                   A         B         C         D  E
2000-01-01  2.267193  1.925006  0.149171 -1.893652  1
2000-01-02  1.516211 -1.073621 -1.299932  1.461930  2
2000-01-03 -0.519746 -0.012736  0.535094  0.373058  3
2000-01-04 -0.783098 -0.333231 -0.742752 -0.143432  4

In [ ]:
df.loc['2000-01-01':'2000-01-04', 'A':'C']

                   A         B         C
2000-01-01  2.267193  1.925006  0.149171
2000-01-02  1.516211 -1.073621 -1.299932
2000-01-03 -0.519746 -0.012736  0.535094
2000-01-04 -0.783098 -0.333231 -0.742752

In [ ]:
df['A']

2000-01-01    2.267193
2000-01-02    1.516211
2000-01-03   -0.519746
2000-01-04   -0.783098
2000-01-05    0.712373
2000-01-06   -0.944119
2000-01-07    1.960937
2000-01-08   -0.544574
Freq: D, Name: A, dtype: float64